bindMountResults/iothreads_4_pipeline_10_connections_512_payload_3_threads_12.txt
====== SET ======
  1000470 requests completed in 1.16 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1.4 milliseconds
0.00% <= 1.5 milliseconds
0.01% <= 1.6 milliseconds
0.01% <= 1.7 milliseconds
0.01% <= 2 milliseconds
0.21% <= 3 milliseconds
27.78% <= 4 milliseconds
44.58% <= 5 milliseconds
45.85% <= 6 milliseconds
72.85% <= 7 milliseconds
96.18% <= 8 milliseconds
99.09% <= 9 milliseconds
99.10% <= 10 milliseconds
99.20% <= 11 milliseconds
99.41% <= 12 milliseconds
99.49% <= 16 milliseconds
99.51% <= 17 milliseconds
99.54% <= 18 milliseconds
99.58% <= 19 milliseconds
99.65% <= 20 milliseconds
99.71% <= 21 milliseconds
99.84% <= 22 milliseconds
99.96% <= 23 milliseconds
100.00% <= 23 milliseconds
865458.44 requests per second

====== GET ======
  1000700 requests completed in 1.00 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
3.37% <= 3 milliseconds
43.69% <= 4 milliseconds
45.17% <= 5 milliseconds
75.82% <= 6 milliseconds
96.91% <= 7 milliseconds
98.72% <= 8 milliseconds
98.89% <= 9 milliseconds
98.93% <= 10 milliseconds
99.02% <= 11 milliseconds
99.17% <= 12 milliseconds
99.34% <= 13 milliseconds
99.36% <= 14 milliseconds
99.43% <= 15 milliseconds
99.53% <= 16 milliseconds
99.70% <= 17 milliseconds
99.81% <= 18 milliseconds
99.90% <= 19 milliseconds
99.91% <= 25 milliseconds
99.94% <= 26 milliseconds
99.95% <= 27 milliseconds
99.99% <= 28 milliseconds
100.00% <= 28 milliseconds
1004718.88 requests per second

====== HSET ======
  1000690 requests completed in 1.31 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.01% <= 3 milliseconds
3.76% <= 4 milliseconds
42.15% <= 5 milliseconds
48.73% <= 6 milliseconds
49.12% <= 7 milliseconds
68.30% <= 8 milliseconds
92.13% <= 9 milliseconds
98.70% <= 10 milliseconds
99.25% <= 11 milliseconds
99.30% <= 12 milliseconds
99.34% <= 13 milliseconds
99.45% <= 14 milliseconds
99.49% <= 20 milliseconds
99.52% <= 21 milliseconds
99.59% <= 22 milliseconds
99.69% <= 23 milliseconds
99.80% <= 24 milliseconds
99.93% <= 25 milliseconds
99.97% <= 28 milliseconds
99.97% <= 29 milliseconds
100.00% <= 30 milliseconds
100.00% <= 30 milliseconds
764469.06 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1001240 requests completed in 1.25 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.10% <= 3 milliseconds
13.29% <= 4 milliseconds
44.19% <= 5 milliseconds
46.81% <= 6 milliseconds
52.61% <= 7 milliseconds
82.52% <= 8 milliseconds
96.18% <= 9 milliseconds
98.46% <= 10 milliseconds
98.81% <= 11 milliseconds
98.99% <= 12 milliseconds
99.15% <= 13 milliseconds
99.29% <= 14 milliseconds
99.32% <= 15 milliseconds
99.36% <= 16 milliseconds
99.45% <= 17 milliseconds
99.47% <= 18 milliseconds
99.49% <= 20 milliseconds
99.52% <= 21 milliseconds
99.58% <= 22 milliseconds
99.66% <= 23 milliseconds
99.74% <= 24 milliseconds
99.83% <= 25 milliseconds
99.92% <= 26 milliseconds
99.97% <= 32 milliseconds
99.97% <= 34 milliseconds
100.00% <= 34 milliseconds
799074.19 requests per second

====== LRANGE_100 (first 100 elements) ======
  1001630 requests completed in 12.20 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 34 milliseconds
0.01% <= 40 milliseconds
0.01% <= 41 milliseconds
0.01% <= 42 milliseconds
0.02% <= 43 milliseconds
0.02% <= 44 milliseconds
0.04% <= 45 milliseconds
0.07% <= 46 milliseconds
0.12% <= 47 milliseconds
0.26% <= 48 milliseconds
0.59% <= 49 milliseconds
1.45% <= 50 milliseconds
3.39% <= 51 milliseconds
6.62% <= 52 milliseconds
11.30% <= 53 milliseconds
17.35% <= 54 milliseconds
24.50% <= 55 milliseconds
32.43% <= 56 milliseconds
41.23% <= 57 milliseconds
50.72% <= 58 milliseconds
60.80% <= 59 milliseconds
70.84% <= 60 milliseconds
79.68% <= 61 milliseconds
86.59% <= 62 milliseconds
91.43% <= 63 milliseconds
94.46% <= 64 milliseconds
96.24% <= 65 milliseconds
97.36% <= 66 milliseconds
98.18% <= 67 milliseconds
98.72% <= 68 milliseconds
99.05% <= 69 milliseconds
99.27% <= 70 milliseconds
99.41% <= 71 milliseconds
99.52% <= 72 milliseconds
99.59% <= 73 milliseconds
99.65% <= 74 milliseconds
99.69% <= 75 milliseconds
99.72% <= 76 milliseconds
99.74% <= 77 milliseconds
99.76% <= 78 milliseconds
99.77% <= 79 milliseconds
99.78% <= 80 milliseconds
99.79% <= 81 milliseconds
99.80% <= 82 milliseconds
99.80% <= 85 milliseconds
99.80% <= 88 milliseconds
99.80% <= 89 milliseconds
99.82% <= 90 milliseconds
99.84% <= 91 milliseconds
99.87% <= 92 milliseconds
99.89% <= 93 milliseconds
99.92% <= 94 milliseconds
99.94% <= 95 milliseconds
99.96% <= 96 milliseconds
99.97% <= 97 milliseconds
99.98% <= 98 milliseconds
99.99% <= 99 milliseconds
100.00% <= 100 milliseconds
100.00% <= 100 milliseconds
82094.09 requests per second

====== MSET (10 keys) ======
  1000870 requests completed in 3.86 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 5 milliseconds
0.03% <= 9 milliseconds
0.10% <= 10 milliseconds
0.49% <= 11 milliseconds
3.05% <= 12 milliseconds
22.67% <= 13 milliseconds
38.49% <= 14 milliseconds
46.68% <= 15 milliseconds
49.96% <= 16 milliseconds
50.99% <= 17 milliseconds
51.15% <= 18 milliseconds
51.20% <= 20 milliseconds
51.21% <= 21 milliseconds
51.39% <= 22 milliseconds
51.99% <= 23 milliseconds
56.72% <= 24 milliseconds
70.56% <= 25 milliseconds
83.02% <= 26 milliseconds
89.71% <= 27 milliseconds
94.32% <= 28 milliseconds
97.20% <= 29 milliseconds
98.55% <= 30 milliseconds
99.15% <= 31 milliseconds
99.31% <= 32 milliseconds
99.34% <= 33 milliseconds
99.46% <= 34 milliseconds
99.49% <= 41 milliseconds
99.50% <= 43 milliseconds
99.59% <= 44 milliseconds
99.71% <= 45 milliseconds
99.82% <= 46 milliseconds
99.97% <= 47 milliseconds
99.98% <= 54 milliseconds
100.00% <= 54 milliseconds
259561.72 requests per second